 i = 0                          # กำหนด ให้ ตำแหน่งที่ 1
 l = len(nums) - 1              # กำหนดให้เป็นตำแหน่งสุดท้าย
        _sum = 0                # สร้างตัวแปร มาเพื่อบวกกัน
        while i <= l:           # ทำการวนลูปหาตั้งแต่ตำแหน่งที่ หนึ่งไปถึง ตำแหน่งสุดท้าย 
            _sum = nums[i] + nums[l]      # บวกกันไปทีละตำแหน่ง
            if _sum == target:            # ถ้าผลบวกใดก็ตามดันไปเจอกับสิ่งที่เราต้องการ 
                return [i+1, l+1]         # ให้ return ตำแหน่งนั้นออกมา
            if _sum > target:             # ถ้า ผลบวกตำแหน่งใดก็ตามที่มากกว่า 
                l = l - 1                 # ให้ ลบ index ตัวสุดท้าย ไป หนึ่ง เพื่อ ไปเริ่มวน หาใหม่
            else:
                i = i + 1                 # ถ้าไม่เจออะไรเลย ให้ บวกไปอีกตำแหน่งเพื่อหา sum ให้เท่ากับ target
